In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('/Users/romanzacharek/Documents/DataScienceProjects/DataExploration/default_of_credit_card_clients__courseware_version_1_21_19.xls')

In [3]:
df.shape

(30000, 25)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 25 columns):
ID                            30000 non-null object
LIMIT_BAL                     30000 non-null int64
SEX                           30000 non-null int64
EDUCATION                     30000 non-null int64
MARRIAGE                      30000 non-null int64
AGE                           30000 non-null int64
PAY_1                         30000 non-null object
PAY_2                         30000 non-null int64
PAY_3                         30000 non-null int64
PAY_4                         30000 non-null int64
PAY_5                         30000 non-null int64
PAY_6                         30000 non-null int64
BILL_AMT1                     30000 non-null int64
BILL_AMT2                     30000 non-null int64
BILL_AMT3                     30000 non-null int64
BILL_AMT4                     30000 non-null int64
BILL_AMT5                     30000 non-null int64
BILL_AMT6                     30000 non-null int64
PAY_AMT1                      30000 non-null int64
PAY_AMT2                      30000 non-null int64
PAY_AMT3                      30000 non-null int64
PAY_AMT4                      30000 non-null int64
PAY_AMT5                      30000 non-null int64
PAY_AMT6                      30000 non-null int64
default payment next month    30000 non-null int64
dtypes: int64(23), object(2)
memory usage: 5.7+ MB

In [6]:
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,798fc410-45c1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,8a8c8f3b-8eb4,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,85698822-43f5,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,0737c11b-be42,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,3b7f77cc-dbc0,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [7]:
df.columns

Index(['ID', 'LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_1',
       'PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default payment next month'],
      dtype='object')

In [8]:
df['ID'].nunique()

29687

In [11]:
df.drop_duplicates('ID')

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,798fc410-45c1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,8a8c8f3b-8eb4,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,85698822-43f5,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,0737c11b-be42,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,3b7f77cc-dbc0,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,ecff42d0-bdc6,220000,1,3,1,39,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,0
29996,99d1fa0e-222b,150000,1,3,2,43,-1,-1,-1,-1,...,8979,5190,0,1837,3526,8998,129,0,0,0
29997,95cdd3e7-4f24,30000,1,2,2,37,4,3,2,-1,...,20878,20582,19357,0,0,22000,4200,2000,3100,1
29998,00d03f02-04cd,80000,1,3,1,41,1,-1,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,1
29999,15d69f9f-5ad3,50000,1,2,1,46,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,1

In [12]:
print("Female default percentage: " + str((df[df['SEX']==2].shape[0]/ df.shape[0] )) + " and the male percentage is: " + str((df[df['SEX']==1].shape[0]/ df.shape[0])))

Female default percentage: 0.597 and the male percentage is: 0.3925

In [13]:
print("Default rates by education,\n graduate school: " 
+ str((df[df['EDUCATION']==1].shape[0]/ df.shape[0])) 
+ "\n university: " + str((df[df['EDUCATION']==2].shape[0]/ df.shape[0])) 
+ "\n high school: " +str((df[df['EDUCATION']==3].shape[0]/ df.shape[0])) 
+ "\n others: " + str((df[df['EDUCATION']==4].shape[0]/ df.shape[0])) )

Default rates by education,
 graduate school: 0.34913333333333335
 university: 0.4628
 high school: 0.16223333333333334
 others: 0.004066666666666666

In [16]:
df_zero_mask = df == 0

In [17]:
print(df_zero_mask)

ID  LIMIT_BAL    SEX  EDUCATION  MARRIAGE    AGE  PAY_1  PAY_2  \
0      False      False  False      False     False  False  False  False
1      False      False  False      False     False  False  False  False
2      False      False  False      False     False  False   True   True
3      False      False  False      False     False  False   True   True
4      False      False  False      False     False  False  False   True
...      ...        ...    ...        ...       ...    ...    ...    ...
29995  False      False  False      False     False  False   True   True
29996  False      False  False      False     False  False  False  False
29997  False      False  False      False     False  False  False  False
29998  False      False  False      False     False  False  False  False
29999  False      False  False      False     False  False   True   True

       PAY_3  PAY_4  ...  BILL_AMT4  BILL_AMT5  BILL_AMT6  PAY_AMT1  PAY_AMT2  \
0      False  False  ...       True       True       True      True     False
1       True   True  ...      False      False      False      True     False
2       True   True  ...      False      False      False     False     False
3       True   True  ...      False      False      False     False     False
4      False   True  ...      False      False      False     False     False
...      ...    ...  ...        ...        ...        ...       ...       ...
29995   True   True  ...      False      False      False     False     False
29996  False  False  ...      False      False       True     False     False
29997  False  False  ...      False      False      False      True      True
29998   True   True  ...      False      False      False     False     False
29999   True   True  ...      False      False      False     False     False

       PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6  default payment next month
0          True      True      True      True                       False
1         False     False      True     False                       False
2         False     False     False     False                        True
3         False     False     False     False                        True
4         False     False     False     False                        True
...         ...       ...       ...       ...                         ...
29995     False     False     False     False                        True
29996     False     False      True      True                        True
29997     False     False     False     False                       False
29998     False     False     False     False                       False
29999     False     False     False     False                       False

[30000 rows x 25 columns]

In [18]:
feature_zero_mask = df_zero_mask.iloc[:,1:].all(axis=1)

In [19]:
feature_zero_mask

0        False
1        False
2        False
3        False
4        False
         ...
29995    False
29996    False
29997    False
29998    False
29999    False
Length: 30000, dtype: bool

In [20]:
df = df.loc[~feature_zero_mask,:].copy()

In [22]:
df.shape

(29685, 25)

In [25]:
df.nunique()

ID                            29685
LIMIT_BAL                        81
SEX                               2
EDUCATION                         7
MARRIAGE                          4
AGE                              56
PAY_1                            12
PAY_2                            11
PAY_3                            11
PAY_4                            11
PAY_5                            10
PAY_6                            10
BILL_AMT1                     22510
BILL_AMT2                     22146
BILL_AMT3                     21822
BILL_AMT4                     21350
BILL_AMT5                     20831
BILL_AMT6                     20417
PAY_AMT1                       7890
PAY_AMT2                       7847
PAY_AMT3                       7463
PAY_AMT4                       6901
PAY_AMT5                       6857
PAY_AMT6                       6895
default payment next month        2
dtype: int64

In [27]:
df['PAY_1'].value_counts()

0                13087
-1                5047
1                 3261
Not available     3021
-2                2476
2                 2378
3                  292
4                   63
5                   23
8                   17
6                   11
7                    9
Name: PAY_1, dtype: int64

In [28]:
valid_pay_1_mask = df['PAY_1'] != 'Not available'

In [29]:
df = df.loc[valid_pay_1_mask,:].copy()

In [31]:
df['PAY_1'] = df['PAY_1'].astype('int64')